In [ ]:
Tips dan Trik Pandas WEEK 2

In [ ]:
# 5. Membalik urutan baris dan kolom pada Data Frame

In [3]:
import pandas as pd
import numpy as np
import pandas.util.testing

In [4]:
# Data Frame sederhana

n_row = 5
n_col = 5
col = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_row, n_col)), 
                  columns=col)
df

   A  B  C  D  E
0  3  1  9  1  6
1  3  7  3  9  2
2  4  2  6  9  9
3  8  7  3  3  9
4  9  7  2  6  9

In [5]:
# membalik urutan kolom

df.loc[:, ::-1]

   E  D  C  B  A
0  6  1  9  1  3
1  2  9  3  7  3
2  9  9  6  2  4
3  9  3  3  7  8
4  9  6  2  7  9

In [6]:
# membalik urutan baris

df.loc[::-1]

   A  B  C  D  E
4  9  7  2  6  9
3  8  7  3  3  9
2  4  2  6  9  9
1  3  7  3  9  2
0  3  1  9  1  6

In [7]:
# membalik urutan baris dan melakukan penyesuain ulang index

df.loc[::-1].reset_index(drop=True)

   A  B  C  D  E
0  9  7  2  6  9
1  8  7  3  3  9
2  4  2  6  9  9
3  3  7  3  9  2
4  3  1  9  1  6

In [ ]:
# 6. Mengganti nama (label) kolom pada Data Frame

In [8]:
# Data Frame sederhana

n_row = 5
n_col = 5
col = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_row, n_col)), 
                  columns=col)
df

   A  B  C  D  E
0  2  2  3  8  3
1  3  5  6  4  1
2  9  3  3  2  6
3  9  6  1  1  2
4  5  7  4  4  5

In [9]:
# Mengganti nama (label) untuk sebuah kolom pada Data Frame

df.rename(columns={'C':'Hobi'})

   A  B  Hobi  D  E
0  2  2     3  8  3
1  3  5     6  4  1
2  9  3     3  2  6
3  9  6     1  1  2
4  5  7     4  4  5

In [10]:
# Mengganti nama (label) untuk banyak kolom pada Data Frame

df.rename(columns={'A':'Nama', 'B':'Alamat', 'D':'Kota'})

   Nama  Alamat  C  Kota  E
0     2       2  3     8  3
1     3       5  6     4  1
2     9       3  3     2  6
3     9       6  1     1  2
4     5       7  4     4  5

In [ ]:
# 7. Menghapus (drop) missing values (NaN)

In [11]:
# Data Frame sederhana

df = pd.util.testing.makeMissingDataframe().reset_index() 
df.head()

        index         A         B         C         D
0  PuhTgEeK3M  0.057191 -1.215013  0.976649  0.815927
1  Ek1Fi5F0KS  0.623719       NaN  1.922611 -0.374913
2  DC6gp0iLzR  1.526999  1.694746 -0.417312 -1.464815
3  YZHw9lUUkQ  0.803830  1.281920 -0.408666 -0.371979
4  sq2nEI6gA9 -0.788693  0.308076 -1.375107 -1.170036

In [12]:
df = df.rename(columns={'index':'Z'})
df.head()

            Z         A         B         C         D
0  PuhTgEeK3M  0.057191 -1.215013  0.976649  0.815927
1  Ek1Fi5F0KS  0.623719       NaN  1.922611 -0.374913
2  DC6gp0iLzR  1.526999  1.694746 -0.417312 -1.464815
3  YZHw9lUUkQ  0.803830  1.281920 -0.408666 -0.371979
4  sq2nEI6gA9 -0.788693  0.308076 -1.375107 -1.170036

In [14]:
df_backup = df.copy(deep=True)

In [15]:
# Menghapus (drop) setiap kolom yang mengandung missing values

df = df_backup.copy(deep=True)
df = df.dropna(axis='rows')
df.head()

            Z         A         B         C         D
0  PuhTgEeK3M  0.057191 -1.215013  0.976649  0.815927
2  DC6gp0iLzR  1.526999  1.694746 -0.417312 -1.464815
3  YZHw9lUUkQ  0.803830  1.281920 -0.408666 -0.371979
4  sq2nEI6gA9 -0.788693  0.308076 -1.375107 -1.170036
6  3irs7tJwse -0.279162 -0.013055  0.865514  0.561693

In [16]:
# Persentase missing values untuk tiap kolom

df = df_backup.copy(deep=True)
df.isna().mean()

Z    0.000000
A    0.100000
B    0.133333
C    0.133333
D    0.033333
dtype: float64

In [17]:
# enghapus (drop) setiap kolom yang mengandung missing values berdasarkan threshold

treshold = len(df) * 0.9
df = df.dropna(thresh=treshold, axis='columns')
df.head()

            Z         A         D
0  PuhTgEeK3M  0.057191  0.815927
1  Ek1Fi5F0KS  0.623719 -0.374913
2  DC6gp0iLzR  1.526999 -1.464815
3  YZHw9lUUkQ  0.803830 -0.371979
4  sq2nEI6gA9 -0.788693 -1.170036

In [ ]:
# 8. Memeriksa kesamaan antar dua buah kolom (Series) pada Data Frame

In [18]:
# Data Frame Sederhana

data = {'A':[15, 15, 18, np.nan, 12], 
        'B':[15, 15, 18, np.nan, 12]}

df = pd.DataFrame(data)
df

      A     B
0  15.0  15.0
1  15.0  15.0
2  18.0  18.0
3   NaN   NaN
4  12.0  12.0

In [ ]:
# Mengenal Pandas Series

In [19]:
df['A']

0    15.0
1    15.0
2    18.0
3     NaN
4    12.0
Name: A, dtype: float64

In [20]:
type(df['A'])

pandas.core.series.Series

In [21]:
type(df)

pandas.core.frame.DataFrame

In [22]:
# Memeriksa kesamaan dengan operator ==

df['A'] == df['B']

0     True
1     True
2     True
3    False
4     True
dtype: bool

In [23]:
# Memeriksa kesamaan dengan method equals()

df['A'].equals(df['B'])

True

In [24]:
# Memeriksa kesamaan antar dua Data Frame

df1 = df.copy(deep=True)

df.equals(df1)

True

In [25]:
f == df1

NameError: name 'f' is not defined